Repository: ReFineID/refineid-apple
Catalog: Sources/App/VirtualIDCard.xcstrings
Source language: en
Languages: fi, sv

# action.apply
source: Apply
fi: Ota käyttöön
sv: Tillämpa

# action.applyAccessibilityLabel
source: Apply virtual card changes
fi: Ota virtuaalikortin muutokset käyttöön
sv: Tillämpa ändringarna av det virtuella kortet

# action.cancel
source: Cancel
fi: Peruuta
sv: Avbryt

# action.cancelAccessibilityLabel
source: Cancel virtual card changes
fi: Peruuta virtuaalikortin muutokset
sv: Avbryt ändringarna av det virtuella kortet

# activation.generation
source: Generation
fi: Korttisukupolvi
sv: Kortgeneration

source: Activation PIN
fi: Aktivointitunnusluku
sv: Aktiveringskod

# activation.pin1Factory
source: PIN 1 is in factory state
fi: PIN 1 on tehdastilassa
sv: PIN 1 har fabriksinställning

# activation.pin2Factory
source: PIN 2 is in factory state
fi: PIN 2 on tehdastilassa
sv: PIN 2 har fabriksinställning

# certificate.authentication
source: Authentication
fi: Tunnistautuminen
sv: Autentisering

# certificate.expired
source: Expired
fi: Vanhentunut
sv: Utgånget

# certificate.missing
source: Missing
fi: Puuttuu
sv: Saknas

# certificate.revoked
source: Revoked
fi: Peruutettu
sv: Återkallat

# certificate.signature
source: Signature
fi: Allekirjoitus
sv: Signatur

# certificate.unreadable
source: Unreadable
fi: Ei luettavissa
sv: Oläsbart

# certificate.valid
source: Valid
fi: Voimassa
sv: Giltigt

# connection.can
source: Card Access Number (CAN)
fi: Kortin pääsykoodi (CAN)
sv: Kortets åtkomstkod (CAN)

# connection.cardPresent
source: Card present
fi: Kortti läsnä
sv: Kort på plats

# connection.readerConnected
source: Reader connected
fi: Kortinlukija yhdistetty
sv: Kortläsare ansluten

# connection.transport
source: Transport
fi: Yhteystapa
sv: Anslutningssätt

# credential.attemptsRemaining
source: %lld attempts remaining
fi: %lld yritystä jäljellä
sv: %lld försök återstår

# credential.pin1Attempts
source: PIN 1 attempts
fi: PIN 1 -yritykset
sv: PIN 1-försök

# credential.pin1Value
source: PIN 1 value
fi: PIN 1 -arvo
sv: PIN 1-värde

# credential.pin2Attempts
source: PIN 2 attempts
fi: PIN 2 -yritykset
sv: PIN 2-försök

# credential.pin2Value
source: PIN 2 value
fi: PIN 2 -arvo
sv: PIN 2-värde

# credential.pukAttempts
source: PUK attempts
fi: PUK-yritykset
sv: PUK-försök

# credential.pukValue
source: PUK value
fi: PUK-arvo
sv: PUK-värde

# device.connectedCan
source: Connected CAN
fi: Yhdistetty CAN
sv: Ansluten CAN

# device.identityCached
source: Identity cached
fi: Identiteetti välimuistissa
sv: Identiteten cachad

# device.pin1Stored
source: PIN 1 stored
fi: PIN 1 tallennettu
sv: PIN 1 sparad

# device.signingPending
source: Signing request pending
fi: Allekirjoituspyyntö odottaa
sv: Signeringsbegäran väntar

# device.storedCan
source: Stored CAN
fi: Tallennettu CAN
sv: Sparad CAN

# device.tokenRegistered
source: Token registered
fi: Tunniste rekisteröity
sv: Token registrerad

# fault.cardRemovedDuringPINChange
source: Card removed during PIN change
fi: Kortti poistetaan PIN-koodin vaihdon aikana
sv: Kortet tas bort under PIN-ändringen

# fault.cardRemovedDuringSignature
source: Card removed during signing
fi: Kortti poistetaan allekirjoituksen aikana
sv: Kortet tas bort under signeringen

# fault.certificateReadFailure
source: Certificate read failure
fi: Varmenteen lukuvirhe
sv: Certifikatet kan inte läsas

# fault.nfcDisconnectBeforeConnection
source: NFC disconnects before connection
fi: NFC-yhteys katkeaa ennen yhdistämistä
sv: NFC kopplas från före anslutning

# fault.none
source: None
fi: Ei mitään
sv: Inget

# fault.picker
source: Fault
fi: Vika
sv: Fel

# fault.readerFailsCounterQuery
source: Reader fails retry counter query
fi: Kortinlukijan yrityslaskurikysely epäonnistuu
sv: Kortläsarens kontroll av återstående försök misslyckas

# fault.responseLostAfterPIN1Activation
source: Response lost after PIN 1 activation
fi: Vastaus katoaa PIN 1:n käyttöönoton jälkeen
sv: Svaret förloras efter aktivering av PIN 1

# fault.responseLostAfterPIN2Activation
source: Response lost after PIN 2 activation
fi: Vastaus katoaa PIN 2:n käyttöönoton jälkeen
sv: Svaret förloras efter aktivering av PIN 2

# fault.responseLostAfterSignature
source: Response lost after signing
fi: Vastaus katkeaa allekirjoituksen jälkeen
sv: Svaret försvinner efter signeringen

# fault.tokenPublicationFailure
source: Token publication failure
fi: Tunnisteen julkaisuvirhe
sv: Tokenpubliceringen misslyckas

# generation.activationCodeIsPuk
source: Activation code is PUK
fi: Aktivointitunnusluku on PUK
sv: Aktiveringskoden är PUK

# generation.presetActivationPIN
source: Separate activation PIN
fi: Erillinen aktivointitunnusluku
sv: Separat aktiveringskod

# identity.electronicClientIdentifier
source: Electronic client identifier
fi: Sähköinen asiointitunnus
sv: Elektronisk klientidentifierare

# identity.name
source: Name
fi: Nimi
sv: Namn

# identity.tokenSerial
source: Token serial
fi: Tunnisteen sarjanumero
sv: Tokenserienummer

# openHint
source: Opens the virtual card settings.
fi: Avaa virtuaalisen henkilökortin asetukset.
sv: Öppnar inställningarna för det virtuella identitetskortet.

# scenario.absent
source: No card
fi: Ei korttia
sv: Inget kort

# scenario.accessibilityLabel
source: Virtual card scenario
fi: Virtuaalikortin tila
sv: Scenario för virtuellt kort

# scenario.activatedNearField
source: Activated NFC card
fi: Käyttöönotettu NFC-kortti
sv: Aktiverat NFC-kort

# scenario.activatedReader
source: Activated reader card
fi: Käyttöönotettu kortinlukijan kortti
sv: Aktiverat kort i kortläsare

# scenario.factoryFreshNearField
source: Factory-fresh NFC card
fi: Tehdasuusi NFC-kortti
sv: Fabriksnytt NFC-kort

# scenario.factoryFreshReader
source: Factory-fresh reader card
fi: Tehdasuusi kortinlukijan kortti
sv: Fabriksnytt kort i kortläsare

# scenario.legacyFactoryFreshNearField
source: Factory-fresh legacy NFC card
fi: Tehdasuusi vanhemman sukupolven NFC-kortti
sv: Fabriksnytt NFC-kort av äldre generation

# scenario.partialActivationNearField
source: Partially activated NFC card
fi: Osittain käyttöönotettu NFC-kortti
sv: Delvis aktiverat NFC-kort

# scenario.pin1RecoveryReader
source: PIN 1 recovery with reader
fi: PIN 1:n palautus kortinlukijalla
sv: Återställ PIN 1 med kortläsare

# scenario.pin2RecoveryReader
source: PIN 2 recovery with reader
fi: PIN 2:n palautus kortinlukijalla
sv: Återställ PIN 2 med kortläsare

# scenario.preset
source: Preset
fi: Esiasetus
sv: Förinställning

# scenario.pukRecoveryRefusedReader
source: PUK recovery refused with reader
fi: PUK-palautus estetty kortinlukijalla
sv: PUK-återställning nekad med kortläsare

# scenario.registeredNearField
source: Registered NFC identity
fi: Rekisteröity NFC-identiteetti
sv: Registrerad NFC-identitet

# section.activation
source: Activation
fi: Käyttöönotto
sv: Aktivering

# section.certificates
source: Certificates
fi: Varmenteet
sv: Certifikat

# section.connection
source: Connection
fi: Yhteys
sv: Anslutning

# section.deviceState
source: Device state
fi: Laitteen tila
sv: Enhetens status

# section.identity
source: Identity
fi: Identiteetti
sv: Identitet

# section.nextFault
source: Next deterministic fault
fi: Seuraava määritetty vika
sv: Nästa deterministiska fel

# section.scenario
source: Scenario
fi: Tilanne

# state.disabled
source: Disabled
fi: Ei käytössä
sv: Inaktiverad

# state.enabled
source: Enabled
fi: Käytössä
sv: Aktiverad

# status.nfcCardPresent
source: NFC, card present
fi: NFC, kortti läsnä
sv: NFC, kort på plats

# status.nfcNoCard
source: NFC, no card present
fi: NFC, ei korttia
sv: NFC, inget kort på plats

# status.readerCardPresent
source: Card reader, card present
fi: Kortinlukija, kortti läsnä
sv: Kortläsare, kort på plats

# status.readerNoCard
source: Card reader, no card present
fi: Kortinlukija, ei korttia
sv: Kortläsare, inget kort på plats

# title
source: Virtual ID Card
fi: Virtuaalikortti
sv: Virtuellt kort

# transport.reader
source: Card reader
fi: Kortinlukija
sv: Kortläsare
